In [1]:
from solution_guidance.cslib import fetch_data

# Fetch Train Data

In [2]:
df = fetch_data("./cs-train/")

# Data Inspection and Summary

In [3]:
df.head()

,country,customer_id,day,invoice,month,price,stream_id,times_viewed,year,invoice_date
0,United Kingdom,13085.0,28,489434,11,6.95,85048,12,2017,2017-11-28
1,United Kingdom,13085.0,28,489434,11,6.75,79323W,12,2017,2017-11-28
2,United Kingdom,13085.0,28,489434,11,2.10,22041,21,2017,2017-11-28
3,United Kingdom,13085.0,28,489434,11,1.25,21232,5,2017,2017-11-28
4,United Kingdom,13085.0,28,489434,11,1.65,22064,17,2017,2017-11-28

In [4]:
df.tail()

,country,customer_id,day,invoice,month,price,stream_id,times_viewed,year,invoice_date
815006,United Kingdom,16098.0,31,562271,7,3.75,22725,2,2019,2019-07-31
815007,United Kingdom,16098.0,31,562271,7,3.75,22726,12,2019,2019-07-31
815008,United Kingdom,16098.0,31,562271,7,3.75,22727,6,2019,2019-07-31
815009,United Kingdom,14056.0,31,562269,7,2.95,22090,2,2019,2019-07-31
815010,United Kingdom,15628.0,31,562163,7,1.65,22558,12,2019,2019-07-31

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 815011 entries, 0 to 815010
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   country       815011 non-null  object
 1   customer_id   625249 non-null  float64
 2   day           815011 non-null  int64
 3   invoice       815011 non-null  object
 4   month         815011 non-null  int64
 5   price         815011 non-null  float64
 6   stream_id     815011 non-null  object
 7   times_viewed  815011 non-null  int64
 8   year          815011 non-null  int64
 9   invoice_date  815011 non-null  datetime64[s]
dtypes: datetime64[s](1), float64(2), int64(4), object(3)
memory usage: 62.2+ MB

In [6]:
df.isnull().sum()

country              0
customer_id     189762
day                  0
invoice              0
month                0
price                0
stream_id            0
times_viewed         0
year                 0
invoice_date         0
dtype: int64

In [7]:
df.describe(include='all')

,country,customer_id,day,invoice,month,price,stream_id,times_viewed,year,invoice_date
count,815011,625249.000000,815011.000000,815011,815011.000000,815011.000000,815011,815011.000000,815011.000000,815011
unique,43,NaN,NaN,42646,NaN,NaN,5007,NaN,NaN,NaN
top,United Kingdom,NaN,NaN,537434,NaN,NaN,85123A,NaN,NaN,NaN
freq,751228,NaN,NaN,1350,NaN,NaN,5017,NaN,NaN,NaN
mean,NaN,15333.415068,15.064819,NaN,6.592718,4.802631,NaN,5.231106,2018.247654,2018-10-01 18:14:32
min,NaN,12346.000000,1.000000,NaN,1.000000,-53594.360000,NaN,0.000000,2017.000000,2017-11-28 00:00:00
25%,NaN,13956.000000,7.000000,NaN,3.000000,1.250000,NaN,1.000000,2018.000000,2018-05-16 00:00:00
50%,NaN,15279.000000,15.000000,NaN,6.000000,2.100000,NaN,3.000000,2018.000000,2018-10-18 00:00:00
75%,NaN,16813.000000,23.000000,NaN,10.000000,4.210000,NaN,8.000000,2019.000000,2019-02-06 00:00:00
max,NaN,18287.000000,31.000000,NaN,12.000000,38970.000000,NaN,24.000000,2019.000000,2019-07-31 00:00:00
std,NaN,1698.360788,8.788845,NaN,3.598781,135.058707,NaN,5.109982,0.545261,NaN

# Quiz Questions

## Question 2.
> When you compiled the JSON files into a single DataFrame or NumPy array, about how many days did the entire range of dates span?

In [8]:
# Retrieve the count of distinct days

print(f"There were {df['invoice_date'].nunique()} unique invoice dates and they ranged a span of {(df['invoice_date'].max() - df['invoice_date'].min()).days} days.")

There were 495 unique invoice dates and they ranged a span of 610 days.

## Question 3
> Which country had the most total revenue when you summed across all purchases?

In [9]:
# Determine the country with the highest number of transactions.
top = df[['country', 'price']].groupby('country')['price'].sum().sort_values(ascending=False)
print(f'The {top.index[0]} had by far the most total revenue over the time period with {top.iloc[0]:,.2f}.')

The United Kingdom had by far the most total revenue over the time period with 3,521,513.50.

[EOF]